[
  {
    "word": "laconic",
    "type": "adjective",
    "definitions": [
      "Using very few words in speech or writing.",
      "words very few Using in speech or writing.",
      "words very or Using in speech few writing.",
      "words very or Using in few speech writing.",
      "words very few Using in or speech writing.",
      "words very few in Using or speech writing.",
      "speech very few in Using or words writing."
    ]
  },
  {
    "word": "focus",
    "type": "noun",
    "definitions": [
      "The center of interest or activity; a point of concentration.",
      "The or of interest center activity; a point of concentration.",
      "The or of activity; center interest a point of concentration.",
      "The point of activity; center interest a or of concentration.",
      "The point of activity; or interest a center of concentration.",
      "The point of interest or activity; a center of concentration.",
      "The of point interest or activity; a center of concentration."
    ]
  },
  {
    "word": "coin",
    "type": "noun",
    "definitions": [
      "A flat, round piece of metal used as money.",
      "A flat, round used of metal piece as money.",
      "A as round used of metal piece flat, money.",
      "A as round used of metal flat, piece money.",
      "A as round of used metal flat, piece money.",
      "as A round of used metal flat, piece money.",
      "as A used of round metal flat, piece money."
    ]
  },
  {
    "word": "brush",
    "type": "noun",
    "definitions": [
      "An implement with bristles set into a block, for cleaning.",
      "An a with bristles set into implement block, for cleaning.",
      "An block, with bristles set into implement a for cleaning.",
      "An into with bristles set block, implement a for cleaning.",
      "An into bristles with set block, implement a for cleaning.",
      "An a bristles with set block, implement into for cleaning.",
      "An a bristles with set block, for into implement cleaning."
    ]
  },
  {
    "word": "avoid",
    "type": "verb",
    "definitions": [
      "To keep away from or stop oneself from doing something.",
      "from keep away from or stop oneself To doing something.",
      "from keep doing from or stop oneself To away something.",
      "from from doing keep or stop oneself To away something.",
      "keep from doing from or stop oneself To away something.",
      "keep To doing from or stop oneself from away something.",
      "keep oneself doing from or stop To from away something."
    ]
  },
  {
    "word": "plate",
    "type": "noun",
    "definitions": [
      "A flat dish from which food is eaten or served.",
      "A flat food from which dish is eaten or served.",
      "A flat food or which dish is eaten from served.",
      "A flat food or dish which is eaten from served.",
      "A flat food or dish is which eaten from served.",
      "A flat food or dish is which from eaten served.",
      "A flat dish or food is which from eaten served."
    ]
  },
  {
    "word": "hide",
    "type": "verb",
    "definitions": [
      "To put or keep someone or something out of sight.",
      "of put or keep someone or something out To sight.",
      "of put or keep someone something or out To sight.",
      "something put or keep someone of or out To sight.",
      "something put or out someone of or keep To sight.",
      "someone put or out something of or keep To sight.",
      "put someone or out something of or keep To sight."
    ]
  },
  {
    "word": "hair",
    "type": "noun",
    "definitions": [
      "Any fine thread-like strand growing from the skin of mammals.",
      "Any fine thread-like skin growing from the strand of mammals.",
      "Any fine thread-like skin growing from of strand the mammals.",
      "Any from thread-like skin growing fine of strand the mammals.",
      "Any from skin thread-like growing fine of strand the mammals.",
      "Any from the thread-like growing fine of strand skin mammals.",
      "Any from the thread-like growing fine skin strand of mammals."
    ]
  },
  {
    "word": "gate",
    "type": "noun",
    "definitions": [
      "A hinged barrier used to close an opening in wall.",
      "A hinged barrier close to used an opening in wall.",
      "A hinged barrier to close used an opening in wall.",
      "A hinged barrier to close an used opening in wall.",
      "A close barrier to hinged an used opening in wall.",
      "A in barrier to hinged an used opening close wall.",
      "A barrier in to hinged an used opening close wall."
    ]
  },
  {
    "word": "harm",
    "type": "noun",
    "definitions": [
      "Physical injury, especially that which is deliberately inflicted on someone.",
      "Physical injury, especially which that is deliberately inflicted on someone.",
      "Physical injury, especially which that is inflicted deliberately on someone.",
      "Physical injury, especially which inflicted is that deliberately on someone.",
      "Physical injury, is which inflicted especially that deliberately on someone.",
      "Physical injury, is which that especially inflicted deliberately on someone.",
      "Physical injury, is which deliberately especially inflicted that on someone."
    ]
  },
  {
    "word": "joke",
    "type": "noun",
    "definitions": [
      "A thing that someone says to cause amusement or laughter.",
      "A thing that someone amusement to cause says or laughter.",
      "A thing that someone amusement to cause or says laughter.",
      "A thing that someone amusement says cause or to laughter.",
      "thing A that someone amusement says cause or to laughter.",
      "thing A that someone or says cause amusement to laughter.",
      "thing or that someone A says cause amusement to laughter."
    ]
  },
  {
    "word": "host",
    "type": "noun",
    "definitions": [
      "A person who receives or entertains other people as guests.",
      "A person who people or entertains other receives as guests.",
      "A person or people who entertains other receives as guests.",
      "A person people or who entertains other receives as guests.",
      "or person people A who entertains other receives as guests.",
      "people person or A who entertains other receives as guests.",
      "who person or A people entertains other receives as guests."
    ]
  },
  {
    "word": "eager",
    "type": "adjective",
    "definitions": [
      "Wanting to do or have something very much; keen desire.",
      "Wanting very do or have something to much; keen desire.",
      "Wanting something do or have very to much; keen desire.",
      "Wanting something do keen have very to much; or desire.",
      "Wanting something do keen have or to much; very desire.",
      "much; something do keen have or to Wanting very desire.",
      "much; something do keen have or to very Wanting desire."
    ]
  },
  {
    "word": "tweak",
    "type": "verb",
    "definitions": [
      "Improve a mechanism or system by making fine adjustments to it.",
      "Improve a mechanism system or by making fine adjustments to it.",
      "adjustments a mechanism system or by making fine Improve to it.",
      "adjustments a mechanism system or making by fine Improve to it.",
      "adjustments a mechanism system or fine by making Improve to it.",
      "adjustments a making system or fine by mechanism Improve to it.",
      "adjustments a making system to fine by mechanism Improve or it."
    ]
  },
  {
    "word": "congenial",
    "type": "adjective",
    "definitions": [
      "Liked on account of having qualities that are similar to one\u0027s own.",
      "Liked on qualities of having account that are similar to one\u0027s own.",
      "Liked on qualities of having account are that similar to one\u0027s own.",
      "Liked of qualities on having account are that similar to one\u0027s own.",
      "Liked of on qualities having account are that similar to one\u0027s own.",
      "Liked of account qualities having on are that similar to one\u0027s own.",
      "Liked similar account qualities having on are that of to one\u0027s own."
    ]
  },
  {
    "word": "guard",
    "type": "noun",
    "definitions": [
      "A person who keeps watch, especially a soldier or sentinel.",
      "A person who keeps watch, especially soldier a or sentinel.",
      "A keeps who person watch, especially soldier a or sentinel.",
      "A keeps who person soldier especially watch, a or sentinel.",
      "A keeps who person a especially watch, soldier or sentinel.",
      "A keeps who person especially a watch, soldier or sentinel.",
      "A keeps watch, person especially a who soldier or sentinel."
    ]
  },
  {
    "word": "staff",
    "type": "noun",
    "definitions": [
      "All the people employed by a particular organization or company.",
      "or the people employed by a particular organization All company.",
      "or the people employed All a particular organization by company.",
      "or the people employed particular a All organization by company.",
      "a the people employed particular or All organization by company.",
      "a people the employed particular or All organization by company.",
      "a particular the employed people or All organization by company."
    ]
  },
  {
    "word": "fact",
    "type": "noun",
    "definitions": [
      "A thing that is known or proved to be true.",
      "A thing that is known proved or to be true.",
      "proved thing that is known A or to be true.",
      "proved thing that or known A is to be true.",
      "proved thing that or known A is be to true.",
      "proved is that or known A thing be to true.",
      "proved is A or known that thing be to true."
    ]
  },
  {
    "word": "bank",
    "type": "noun",
    "definitions": [
      "An institution offering financial services like storing money safely.",
      "storing institution offering financial services like An money safely.",
      "storing institution An financial services like offering money safely.",
      "storing money An financial services like offering institution safely.",
      "storing An money financial services like offering institution safely.",
      "storing institution money financial services like offering An safely.",
      "storing money institution financial services like offering An safely."
    ]
  },
  {
    "word": "ice",
    "type": "noun",
    "definitions": [
      "Frozen water, a brittle transparent crystalline solid form.",
      "Frozen water, transparent brittle a crystalline solid form.",
      "Frozen water, brittle transparent a crystalline solid form.",
      "Frozen crystalline brittle transparent a water, solid form.",
      "Frozen crystalline brittle transparent a solid water, form.",
      "Frozen crystalline brittle transparent solid a water, form.",
      "Frozen water, brittle transparent solid a crystalline form."
    ]
  },
  {
    "word": "luck",
    "type": "noun",
    "definitions": [
      "Success or failure brought by chance rather than through actions.",
      "Success or failure brought by chance than rather through actions.",
      "Success or by brought failure chance than rather through actions.",
      "Success or through brought failure chance than rather by actions.",
      "than or through brought failure chance Success rather by actions.",
      "failure or through brought than chance Success rather by actions.",
      "by or through brought than chance Success rather failure actions."
    ]
  },
  {
    "word": "boat",
    "type": "noun",
    "definitions": [
      "A vessel propelled on water by oars, sails, or an engine.",
      "A vessel propelled on water sails, oars, by or an engine.",
      "A oars, propelled on water sails, vessel by or an engine.",
      "A sails, propelled on water oars, vessel by or an engine.",
      "on sails, propelled A water oars, vessel by or an engine.",
      "on sails, propelled A water by vessel oars, or an engine.",
      "on sails, vessel A water by propelled oars, or an engine."
    ]
  },
  {
    "word": "pilot",
    "type": "noun",
    "definitions": [
      "A person who operates the flying controls of an aircraft.",
      "A an who operates the flying controls of person aircraft.",
      "who an A operates the flying controls of person aircraft.",
      "who an A the operates flying controls of person aircraft.",
      "operates an A the who flying controls of person aircraft.",
      "operates an the A who flying controls of person aircraft.",
      "operates an the flying who A controls of person aircraft."
    ]
  },
  {
    "word": "gift",
    "type": "noun",
    "definitions": [
      "A thing given willingly to someone without payment; a present.",
      "A thing willingly given to someone without payment; a present.",
      "A a willingly given to someone without payment; thing present.",
      "A a willingly to given someone without payment; thing present.",
      "A a willingly to given someone without thing payment; present.",
      "A given willingly to a someone without thing payment; present.",
      "A given willingly to someone a without thing payment; present."
    ]
  },
  {
    "word": "log",
    "type": "verb",
    "definitions": [
      "To enter information in a record book or computer system.",
      "To enter information in record a book or computer system.",
      "To enter information record in a book or computer system.",
      "in enter information record To a book or computer system.",
      "in enter information record a To book or computer system.",
      "in enter information record computer To book or a system.",
      "in enter information book computer To record or a system."
    ]
  },
  {
    "word": "doubt",
    "type": "noun",
    "definitions": [
      "A feeling of uncertainty or lack of conviction about something.",
      "A of feeling uncertainty or lack of conviction about something.",
      "A of feeling about or lack of conviction uncertainty something.",
      "A of feeling about or of lack conviction uncertainty something.",
      "A of feeling about or uncertainty lack conviction of something.",
      "A of feeling about or uncertainty lack of conviction something.",
      "about of feeling A or uncertainty lack of conviction something."
    ]
  },
  {
    "word": "voice",
    "type": "noun",
    "definitions": [
      "The sound produced in a person\u0027s larynx and uttered through.",
      "The sound produced in uttered person\u0027s larynx and a through.",
      "and sound produced in uttered person\u0027s larynx The a through.",
      "and sound produced in uttered larynx person\u0027s The a through.",
      "and sound produced in larynx uttered person\u0027s The a through.",
      "in sound produced and larynx uttered person\u0027s The a through.",
      "in sound produced and larynx The person\u0027s uttered a through."
    ]
  },
  {
    "word": "lung",
    "type": "noun",
    "definitions": [
      "Each of the pair of organs situated within rib cage.",
      "organs of the pair of Each situated within rib cage.",
      "organs of the pair of rib situated within Each cage.",
      "of organs the pair of rib situated within Each cage.",
      "of organs pair the of rib situated within Each cage.",
      "of the pair organs of rib situated within Each cage.",
      "of the pair within of rib situated organs Each cage."
    ]
  },
  {
    "word": "sprawled",
    "type": "adjective",
    "definitions": [
      "Spread out over a large area in an untidy or irregular fashion.",
      "Spread in over a large area out an untidy or irregular fashion.",
      "Spread a over in large area out an untidy or irregular fashion.",
      "Spread a over an large area out in untidy or irregular fashion.",
      "in a over an large area out Spread untidy or irregular fashion.",
      "in a over an large area out or untidy Spread irregular fashion.",
      "untidy a over an large area out or in Spread irregular fashion."
    ]
  },
  {
    "word": "team",
    "type": "noun",
    "definitions": [
      "A group of players forming one side in competitive game.",
      "A group competitive players forming one side in of game.",
      "forming group competitive players A one side in of game.",
      "forming group competitive one A players side in of game.",
      "forming group competitive one A in side players of game.",
      "players group competitive one A in side forming of game.",
      "players group competitive one A side in forming of game."
    ]
  },
  {
    "word": "beg",
    "type": "verb",
    "definitions": [
      "To ask someone earnestly or humbly for something needed greatly.",
      "To ask someone earnestly for humbly or something needed greatly.",
      "for ask someone earnestly To humbly or something needed greatly.",
      "for ask someone earnestly To or humbly something needed greatly.",
      "for needed someone earnestly To or humbly something ask greatly.",
      "for needed earnestly someone To or humbly something ask greatly.",
      "for needed earnestly someone something or humbly To ask greatly."
    ]
  },
  {
    "word": "obsequious",
    "type": "adjective",
    "definitions": [
      "Promptly obedient, or submissive, to the will of another; compliant.",
      "Promptly or obedient, submissive, to the will of another; compliant.",
      "Promptly or obedient, of to the will submissive, another; compliant.",
      "Promptly or obedient, of to the submissive, will another; compliant.",
      "Promptly submissive, obedient, of to the or will another; compliant.",
      "submissive, Promptly obedient, of to the or will another; compliant.",
      "submissive, obedient, Promptly of to the or will another; compliant."
    ]
  },
  {
    "word": "boot",
    "type": "noun",
    "definitions": [
      "A sturdy item of footwear covering the foot and lower leg.",
      "A sturdy item of footwear covering foot the and lower leg.",
      "A sturdy item the footwear covering foot of and lower leg.",
      "A sturdy item the footwear and foot of covering lower leg.",
      "footwear sturdy item the A and foot of covering lower leg.",
      "footwear sturdy item the A foot and of covering lower leg.",
      "footwear sturdy item the A foot of and covering lower leg."
    ]
  },
  {
    "word": "food",
    "type": "noun",
    "definitions": [
      "Any nutritious substance that people or animals eat or drink.",
      "animals nutritious substance that people or Any eat or drink.",
      "nutritious animals substance that people or Any eat or drink.",
      "nutritious animals substance eat people or Any that or drink.",
      "nutritious animals substance eat or or Any that people drink.",
      "nutritious animals Any eat or or substance that people drink.",
      "animals nutritious Any eat or or substance that people drink."
    ]
  },
  {
    "word": "graphic",
    "type": "adjective",
    "definitions": [
      "Giving clear and vividly explicit details.",
      "Giving clear vividly and explicit details.",
      "Giving and vividly clear explicit details.",
      "Giving vividly and clear explicit details.",
      "and vividly Giving clear explicit details.",
      "and vividly Giving explicit clear details.",
      "vividly and Giving explicit clear details."
    ]
  },
  {
    "word": "glide",
    "type": "verb",
    "definitions": [
      "To move smoothly without effort or sudden motion",
      "To or smoothly without effort move sudden motion",
      "To or smoothly without effort sudden move motion",
      "To sudden smoothly without effort or move motion",
      "smoothly sudden To without effort or move motion",
      "smoothly sudden move without effort or To motion",
      "smoothly sudden without move effort or To motion"
    ]
  },
  {
    "word": "chop",
    "type": "verb",
    "definitions": [
      "To cut something into small pieces with repeated sharp blows.",
      "To cut something with small pieces into repeated sharp blows.",
      "cut To something with small pieces into repeated sharp blows.",
      "something To cut with small pieces into repeated sharp blows.",
      "something cut To with small pieces into repeated sharp blows.",
      "something cut repeated with small pieces into To sharp blows.",
      "something cut repeated small with pieces into To sharp blows."
    ]
  },
  {
    "word": "file",
    "type": "noun",
    "definitions": [
      "A folder or box for holding loose papers that are related.",
      "A folder or box for holding papers loose that are related.",
      "A folder or box for holding papers are that loose related.",
      "A or folder box for holding papers are that loose related.",
      "A or folder box holding for papers are that loose related.",
      "A or folder box papers for holding are that loose related.",
      "A or folder papers box for holding are that loose related."
    ]
  },
  {
    "word": "angry",
    "type": "adjective",
    "definitions": [
      "Feeling or showing strong annoyance, displeasure, or hostility towards someone.",
      "Feeling or hostility strong annoyance, displeasure, or showing towards someone.",
      "or Feeling hostility strong annoyance, displeasure, or showing towards someone.",
      "or Feeling hostility strong annoyance, displeasure, showing or towards someone.",
      "or Feeling hostility strong annoyance, or showing displeasure, towards someone.",
      "or Feeling hostility annoyance, strong or showing displeasure, towards someone.",
      "or Feeling hostility annoyance, strong displeasure, showing or towards someone."
    ]
  },
  {
    "word": "serve",
    "type": "verb",
    "definitions": [
      "To perform duties or services for another person or organization.",
      "To perform duties or services another for person or organization.",
      "To perform or duties services another for person or organization.",
      "services perform or duties To another for person or organization.",
      "services person or duties To another for perform or organization.",
      "services duties or person To another for perform or organization.",
      "another duties or person To services for perform or organization."
    ]
  },
  {
    "word": "hope",
    "type": "noun",
    "definitions": [
      "A feeling of expectation and desire for a certain thing.",
      "a feeling of expectation and desire for A certain thing.",
      "a feeling of expectation A desire for and certain thing.",
      "a feeling of expectation A and for desire certain thing.",
      "a A of expectation feeling and for desire certain thing.",
      "a A of expectation and feeling for desire certain thing.",
      "a A of desire and feeling for expectation certain thing."
    ]
  },
  {
    "word": "agree",
    "type": "verb",
    "definitions": [
      "To have the same opinion about something; concur with views.",
      "with have the same opinion about something; concur To views.",
      "something; have the same opinion about with concur To views.",
      "something; have the same opinion about concur with To views.",
      "something; concur the same opinion about have with To views.",
      "something; concur the have opinion about same with To views.",
      "something; concur the have about opinion same with To views."
    ]
  },
  {
    "word": "sea",
    "type": "noun",
    "definitions": [
      "The expanse of salt water surrounding the earth\u0027s land masses.",
      "expanse The of salt water surrounding the earth\u0027s land masses.",
      "salt The of expanse water surrounding the earth\u0027s land masses.",
      "surrounding The of expanse water salt the earth\u0027s land masses.",
      "surrounding earth\u0027s of expanse water salt the The land masses.",
      "surrounding earth\u0027s of The water salt the expanse land masses.",
      "land earth\u0027s of The water salt the expanse surrounding masses."
    ]
  },
  {
    "word": "march",
    "type": "verb",
    "definitions": [
      "To walk in a military manner with regular measured tread.",
      "To walk in military a manner with regular measured tread.",
      "To walk in military measured manner with regular a tread.",
      "To manner in military measured walk with regular a tread.",
      "military manner in To measured walk with regular a tread.",
      "military manner in To measured with walk regular a tread.",
      "military manner in To measured a walk regular with tread."
    ]
  },
  {
    "word": "stage",
    "type": "noun",
    "definitions": [
      "A point, period, or step in a process or development.",
      "A point, period, or process in a step or development.",
      "A or period, point, process in a step or development.",
      "A or period, step process in a point, or development.",
      "step or period, A process in a point, or development.",
      "step in period, A process or a point, or development.",
      "step in period, A or process a point, or development."
    ]
  },
  {
    "word": "hook",
    "type": "noun",
    "definitions": [
      "A piece of metal curved or bent back to catch.",
      "A piece of metal curved or bent to back catch.",
      "A piece of metal curved or back to bent catch.",
      "A piece of metal back or curved to bent catch.",
      "A piece of back metal or curved to bent catch.",
      "A piece of back to or curved metal bent catch.",
      "A piece or back to of curved metal bent catch."
    ]
  },
  {
    "word": "repair",
    "type": "verb",
    "definitions": [
      "To restore something damaged, faulty, or worn to good condition.",
      "damaged, restore something To faulty, or worn to good condition.",
      "damaged, restore To something faulty, or worn to good condition.",
      "damaged, restore To something faulty, or worn good to condition.",
      "damaged, restore To something to or worn good faulty, condition.",
      "damaged, restore To worn to or something good faulty, condition.",
      "damaged, restore worn To to or something good faulty, condition."
    ]
  },
  {
    "word": "milk",
    "type": "noun",
    "definitions": [
      "An opaque white fluid rich in fat protein, produced by mammals.",
      "An opaque produced fluid rich in fat protein, white by mammals.",
      "An opaque produced fluid protein, in fat rich white by mammals.",
      "An opaque produced fluid in protein, fat rich white by mammals.",
      "An opaque produced in fluid protein, fat rich white by mammals.",
      "An opaque produced in fluid rich fat protein, white by mammals.",
      "An opaque in produced fluid rich fat protein, white by mammals."
    ]
  },
  {
    "word": "spoil",
    "type": "verb",
    "definitions": [
      "To diminish or destroy the value or quality of something.",
      "To diminish or destroy the or value quality of something.",
      "To diminish or destroy of or value quality the something.",
      "To diminish of destroy or or value quality the something.",
      "To diminish of destroy the or value quality or something.",
      "To diminish of or the destroy value quality or something.",
      "To diminish of or quality destroy value the or something."
    ]
  },
  {
    "word": "class",
    "type": "noun",
    "definitions": [
      "A group of students taught together following a particular course.",
      "A group of particular taught together following a students course.",
      "A group of particular taught students following a together course.",
      "A group of particular taught students together a following course.",
      "together group of particular taught students A a following course.",
      "together group of taught particular students A a following course.",
      "together group following taught particular students A a of course."
    ]
  },
  {
    "word": "deal",
    "type": "noun",
    "definitions": [
      "An agreement entered into by two or more parties.",
      "An agreement entered into by or two more parties.",
      "An or entered into by agreement two more parties.",
      "entered or An into by agreement two more parties.",
      "into or An entered by agreement two more parties.",
      "into or An entered by more two agreement parties.",
      "into or An agreement by more two entered parties."
    ]
  },
  {
    "word": "cost",
    "type": "noun",
    "definitions": [
      "An amount that has to be paid to buy something.",
      "An has that amount to be paid to buy something.",
      "An has that amount to to paid be buy something.",
      "buy has that amount to to paid be An something.",
      "buy has that amount to to An be paid something.",
      "buy to that amount has to An be paid something.",
      "buy to An amount has to that be paid something."
    ]
  },
  {
    "word": "glare",
    "type": "verb",
    "definitions": [
      "To stare in an angry or fierce way.",
      "an stare in To angry or fierce way.",
      "fierce stare in To angry or an way.",
      "fierce stare To in angry or an way.",
      "fierce To stare in angry or an way.",
      "fierce To stare or angry in an way.",
      "fierce To angry or stare in an way."
    ]
  },
  {
    "word": "match",
    "type": "noun",
    "definitions": [
      "A contest in which people or teams compete against each.",
      "A contest in which compete or teams people against each.",
      "A contest in which compete or against people teams each.",
      "A contest in which compete or against teams people each.",
      "A contest which in compete or against teams people each.",
      "A contest which compete in or against teams people each.",
      "A contest against compete in or which teams people each."
    ]
  },
  {
    "word": "bread",
    "type": "noun",
    "definitions": [
      "Staple food made from flour, water, and yeast or similar agent.",
      "Staple food made flour, from water, and yeast or similar agent.",
      "Staple food made flour, yeast water, and from or similar agent.",
      "Staple from made flour, yeast water, and food or similar agent.",
      "Staple or made flour, yeast water, and food from similar agent.",
      "Staple or made flour, yeast water, food and from similar agent.",
      "Staple or flour, made yeast water, food and from similar agent."
    ]
  },
  {
    "word": "queen",
    "type": "noun",
    "definitions": [
      "The female ruler of an independent state, especially a hereditary one.",
      "The of ruler female an independent state, especially a hereditary one.",
      "The of independent female an ruler state, especially a hereditary one.",
      "The of independent ruler an female state, especially a hereditary one.",
      "The of independent ruler an female especially state, a hereditary one.",
      "female of independent ruler an The especially state, a hereditary one.",
      "female of independent ruler an The state, especially a hereditary one."
    ]
  },
  {
    "word": "assuage",
    "type": "verb",
    "definitions": [
      "Make an unpleasant feeling less intense or satisfy a desire.",
      "feeling an unpleasant Make less intense or satisfy a desire.",
      "feeling an unpleasant Make less a or satisfy intense desire.",
      "feeling an unpleasant Make satisfy a or less intense desire.",
      "feeling an unpleasant Make satisfy a intense less or desire.",
      "feeling intense unpleasant Make satisfy a an less or desire.",
      "feeling intense unpleasant Make satisfy a an or less desire."
    ]
  },
  {
    "word": "pay",
    "type": "noun",
    "definitions": [
      "Money given to someone for work done or debt incurred.",
      "Money given for someone to work done or debt incurred.",
      "Money someone for given to work done or debt incurred.",
      "Money someone given for to work done or debt incurred.",
      "Money or given for to work done someone debt incurred.",
      "Money or given for to debt done someone work incurred.",
      "Money to given for or debt done someone work incurred."
    ]
  },
  {
    "word": "formidable",
    "type": "adjective",
    "definitions": [
      "Inspiring fear or respect through being impressively large, powerful or capable.",
      "or fear or respect through being impressively large, powerful Inspiring capable.",
      "fear or or respect through being impressively large, powerful Inspiring capable.",
      "fear large, or respect through being impressively or powerful Inspiring capable.",
      "fear large, through respect or being impressively or powerful Inspiring capable.",
      "fear large, Inspiring respect or being impressively or powerful through capable.",
      "fear large, being respect or Inspiring impressively or powerful through capable."
    ]
  },
  {
    "word": "rain",
    "type": "noun",
    "definitions": [
      "Moisture condensed from the atmosphere that falls in separate drops.",
      "Moisture condensed from atmosphere the that falls in separate drops.",
      "Moisture from condensed atmosphere the that falls in separate drops.",
      "falls from condensed atmosphere the that Moisture in separate drops.",
      "falls from condensed in the that Moisture atmosphere separate drops.",
      "falls from that in the condensed Moisture atmosphere separate drops.",
      "falls from that the in condensed Moisture atmosphere separate drops."
    ]
  },
  {
    "word": "teach",
    "type": "verb",
    "definitions": [
      "To show or explain to someone how to do something.",
      "To show or do to someone how to explain something.",
      "show To or do to someone how to explain something.",
      "do To or show to someone how to explain something.",
      "do To or show explain someone how to to something.",
      "or To do show explain someone how to to something.",
      "or To someone show explain do how to to something."
    ]
  },
  {
    "word": "brick",
    "type": "noun",
    "definitions": [
      "A small rectangular block used for building, made from fired clay.",
      "A small rectangular block from for building, made used fired clay.",
      "A small rectangular block made for building, from used fired clay.",
      "from small rectangular block made for building, A used fired clay.",
      "from small rectangular block made building, for A used fired clay.",
      "from small fired block made building, for A used rectangular clay.",
      "from A fired block made building, for small used rectangular clay."
    ]
  },
  {
    "word": "film",
    "type": "noun",
    "definitions": [
      "A story or event recorded by a camera as moving images.",
      "A event or story recorded by a camera as moving images.",
      "A event or story recorded as a camera by moving images.",
      "A event or story recorded as a by camera moving images.",
      "A recorded or story event as a by camera moving images.",
      "moving recorded or story event as a by camera A images.",
      "moving recorded or story event as by a camera A images."
    ]
  },
  {
    "word": "pearl",
    "type": "noun",
    "definitions": [
      "A smooth round object formed inside a shell",
      "A smooth object round formed inside a shell",
      "a smooth object round formed inside A shell",
      "a object smooth round formed inside A shell",
      "smooth object a round formed inside A shell",
      "smooth object a round A inside formed shell",
      "round object a smooth A inside formed shell"
    ]
  },
  {
    "word": "bell",
    "type": "noun",
    "definitions": [
      "A hollow metal cup that makes a ringing sound when struck.",
      "A ringing metal cup that makes a hollow sound when struck.",
      "cup ringing metal A that makes a hollow sound when struck.",
      "cup ringing metal A sound makes a hollow that when struck.",
      "ringing cup metal A sound makes a hollow that when struck.",
      "ringing cup metal A sound makes hollow a that when struck.",
      "ringing cup metal A sound makes hollow when that a struck."
    ]
  },
  {
    "word": "deer",
    "type": "noun",
    "definitions": [
      "A hoofed grazing animal with branched bony antlers on males.",
      "A hoofed grazing branched with animal bony antlers on males.",
      "A hoofed grazing branched with animal antlers bony on males.",
      "A hoofed grazing branched animal with antlers bony on males.",
      "A branched grazing hoofed animal with antlers bony on males.",
      "A branched grazing antlers animal with hoofed bony on males.",
      "A branched grazing antlers hoofed with animal bony on males."
    ]
  },
  {
    "word": "horse",
    "type": "noun",
    "definitions": [
      "A large domestic mammal with solid hoofs, flowing mane.",
      "A domestic large mammal with solid hoofs, flowing mane.",
      "A flowing large mammal with solid hoofs, domestic mane.",
      "with flowing large mammal A solid hoofs, domestic mane.",
      "with flowing large mammal A domestic hoofs, solid mane.",
      "with hoofs, large mammal A domestic flowing solid mane.",
      "with hoofs, A mammal large domestic flowing solid mane."
    ]
  },
  {
    "word": "grain",
    "type": "noun",
    "definitions": [
      "Wheat or any other cultivated cereal crop used as food.",
      "Wheat or any cultivated other cereal crop used as food.",
      "Wheat or other cultivated any cereal crop used as food.",
      "Wheat as other cultivated any cereal crop used or food.",
      "Wheat as other cultivated any crop cereal used or food.",
      "Wheat as other used any crop cereal cultivated or food.",
      "Wheat as other used cereal crop any cultivated or food."
    ]
  },
  {
    "word": "truth",
    "type": "noun",
    "definitions": [
      "The quality or state of being in accordance with fact.",
      "The quality or in of being state accordance with fact.",
      "The quality or of in being state accordance with fact.",
      "The quality or of accordance being state in with fact.",
      "The quality or of being accordance state in with fact.",
      "The of or quality being accordance state in with fact.",
      "The of or quality being in state accordance with fact."
    ]
  },
  {
    "word": "cake",
    "type": "noun",
    "definitions": [
      "A sweet baked food item made from flour, sugar, eggs.",
      "baked sweet A food item made from flour, sugar, eggs.",
      "baked sweet food A item made from flour, sugar, eggs.",
      "baked sweet food A item sugar, from flour, made eggs.",
      "baked flour, food A item sugar, from sweet made eggs.",
      "baked flour, food A item from sugar, sweet made eggs.",
      "sweet flour, food A item from sugar, baked made eggs."
    ]
  },
  {
    "word": "idea",
    "type": "noun",
    "definitions": [
      "A thought or suggestion as to a possible course of action.",
      "thought A or suggestion as to a possible course of action.",
      "thought A course suggestion as to a possible or of action.",
      "thought A course as suggestion to a possible or of action.",
      "thought A course as suggestion to a of or possible action.",
      "thought A course as suggestion to a of possible or action.",
      "thought as course A suggestion to a of possible or action."
    ]
  },
  {
    "word": "veil",
    "type": "noun",
    "definitions": [
      "A piece of fine material worn by women to protect or conceal the face.",
      "A worn of fine material piece by women to protect or conceal the face.",
      "the worn of fine material piece by women to protect or conceal A face.",
      "the worn of fine material piece by to women protect or conceal A face.",
      "the fine of worn material piece by to women protect or conceal A face.",
      "fine the of worn material piece by to women protect or conceal A face.",
      "fine the of worn material piece by to women or protect conceal A face."
    ]
  },
  {
    "word": "copy",
    "type": "noun",
    "definitions": [
      "A thing made to be similar or identical to another item.",
      "A thing made to be similar to identical or another item.",
      "A thing made be to similar to identical or another item.",
      "thing A made be to similar to identical or another item.",
      "thing A made be to similar or identical to another item.",
      "thing be made A to similar or identical to another item.",
      "thing be made A similar to or identical to another item."
    ]
  },
  {
    "word": "fight",
    "type": "noun",
    "definitions": [
      "A violent confrontation or struggle involving physical force or weapons.",
      "A violent confrontation involving struggle or physical force or weapons.",
      "A violent struggle involving confrontation or physical force or weapons.",
      "A violent struggle involving confrontation force physical or or weapons.",
      "A violent struggle or confrontation force physical or involving weapons.",
      "A violent confrontation or struggle force physical or involving weapons.",
      "A violent confrontation or struggle or physical force involving weapons."
    ]
  },
  {
    "word": "juice",
    "type": "noun",
    "definitions": [
      "The liquid obtained from or present in fruit or vegetables.",
      "The liquid fruit from or present in obtained or vegetables.",
      "The liquid present from or fruit in obtained or vegetables.",
      "The liquid present from or obtained in fruit or vegetables.",
      "The liquid present from or obtained or fruit in vegetables.",
      "The liquid obtained from or present or fruit in vegetables.",
      "The or obtained from liquid present or fruit in vegetables."
    ]
  },
  {
    "word": "pinch",
    "type": "verb",
    "definitions": [
      "Grip something tightly and sharply between finger and thumb.",
      "Grip finger tightly and sharply between something and thumb.",
      "Grip finger and and sharply between something tightly thumb.",
      "Grip and finger and sharply between something tightly thumb.",
      "Grip and and finger sharply between something tightly thumb.",
      "between and and finger sharply Grip something tightly thumb.",
      "finger and and between sharply Grip something tightly thumb."
    ]
  },
  {
    "word": "trick",
    "type": "noun",
    "definitions": [
      "A cunning act or scheme intended to deceive or outwit.",
      "A cunning act or scheme intended deceive to or outwit.",
      "A cunning act or scheme deceive intended to or outwit.",
      "A to act or scheme deceive intended cunning or outwit.",
      "A to or act scheme deceive intended cunning or outwit.",
      "A to or act scheme deceive intended or cunning outwit.",
      "A to or intended scheme deceive act or cunning outwit."
    ]
  },
  {
    "word": "cruel",
    "type": "adjective",
    "definitions": [
      "Willfully causing pain or suffering to others, feeling no concern.",
      "Willfully to pain or suffering causing others, feeling no concern.",
      "Willfully to feeling or suffering causing others, pain no concern.",
      "Willfully to feeling or suffering others, causing pain no concern.",
      "Willfully to others, or suffering feeling causing pain no concern.",
      "no to others, or suffering feeling causing pain Willfully concern.",
      "no to others, suffering or feeling causing pain Willfully concern."
    ]
  },
  {
    "word": "philistine",
    "type": "noun",
    "definitions": [
      "A person who is hostile or indifferent to culture and the arts.",
      "A indifferent who is hostile or person to culture and the arts.",
      "A indifferent person is hostile or who to culture and the arts.",
      "A indifferent person is hostile or who the culture and to arts.",
      "A indifferent person is hostile or who the and culture to arts.",
      "A indifferent person the hostile or who is and culture to arts.",
      "to indifferent person the hostile or who is and culture A arts."
    ]
  },
  {
    "word": "foot",
    "type": "noun",
    "definitions": [
      "The lower extremity of the leg below the ankle.",
      "The lower the of extremity leg below the ankle.",
      "The lower the of extremity below leg the ankle.",
      "The the lower of extremity below leg the ankle.",
      "the the lower of extremity below leg The ankle.",
      "the the below of extremity lower leg The ankle.",
      "the the below leg extremity lower of The ankle."
    ]
  },
  {
    "word": "skip",
    "type": "verb",
    "definitions": [
      "To move along lightly, stepping from one foot to other.",
      "one move along lightly, stepping from To foot to other.",
      "one along move lightly, stepping from To foot to other.",
      "To along move lightly, stepping from one foot to other.",
      "To stepping move lightly, along from one foot to other.",
      "lightly, stepping move To along from one foot to other.",
      "lightly, stepping move To foot from one along to other."
    ]
  },
  {
    "word": "amenable",
    "type": "adjective",
    "definitions": [
      "Open and responsive to suggestion; easily persuaded or controlled",
      "Open and to responsive suggestion; easily persuaded or controlled",
      "Open easily to responsive suggestion; and persuaded or controlled",
      "Open easily to or suggestion; and persuaded responsive controlled",
      "responsive easily to or suggestion; and persuaded Open controlled",
      "and easily to or suggestion; responsive persuaded Open controlled",
      "and to easily or suggestion; responsive persuaded Open controlled"
    ]
  },
  {
    "word": "effusive",
    "type": "adjective",
    "definitions": [
      "Expressing gratitude or pleasure in an unrestrained or heartfelt manner.",
      "Expressing gratitude or pleasure unrestrained an in or heartfelt manner.",
      "Expressing gratitude or pleasure heartfelt an in or unrestrained manner.",
      "Expressing pleasure or gratitude heartfelt an in or unrestrained manner.",
      "heartfelt pleasure or gratitude Expressing an in or unrestrained manner.",
      "or pleasure or gratitude Expressing an in heartfelt unrestrained manner.",
      "or unrestrained or gratitude Expressing an in heartfelt pleasure manner."
    ]
  },
  {
    "word": "smile",
    "type": "verb",
    "definitions": [
      "To form one\u0027s features into a pleased, kind, amused expression.",
      "To one\u0027s form features into a pleased, kind, amused expression.",
      "To amused form features into a pleased, kind, one\u0027s expression.",
      "To amused into features form a pleased, kind, one\u0027s expression.",
      "To amused into features form a kind, pleased, one\u0027s expression.",
      "To amused into pleased, form a kind, features one\u0027s expression.",
      "To amused form pleased, into a kind, features one\u0027s expression."
    ]
  },
  {
    "word": "knife",
    "type": "noun",
    "definitions": [
      "An instrument composed of a blade fixed into a handle.",
      "An instrument composed of into blade fixed a a handle.",
      "An fixed composed of into blade instrument a a handle.",
      "An blade composed of into fixed instrument a a handle.",
      "An blade composed of into a instrument a fixed handle.",
      "An composed blade of into a instrument a fixed handle.",
      "An into blade of composed a instrument a fixed handle."
    ]
  },
  {
    "word": "fair",
    "type": "adjective",
    "definitions": [
      "Treating people equally without any favoritism or discrimination.",
      "Treating people equally without or favoritism any discrimination.",
      "Treating people equally or without favoritism any discrimination.",
      "Treating without equally or people favoritism any discrimination.",
      "without Treating equally or people favoritism any discrimination.",
      "without Treating equally or people any favoritism discrimination.",
      "without favoritism equally or people any Treating discrimination."
    ]
  },
  {
    "word": "row",
    "type": "noun",
    "definitions": [
      "A number of people or things in a straight line.",
      "A in of people or things number a straight line.",
      "straight in of people or things number a A line.",
      "people in of straight or things number a A line.",
      "people in of straight number things or a A line.",
      "people in of straight number things a or A line.",
      "a in of straight number things people or A line."
    ]
  },
  {
    "word": "nerve",
    "type": "noun",
    "definitions": [
      "A fiber or bundle of fibers transmitting impulses of sensation.",
      "A fibers or bundle of fiber transmitting impulses of sensation.",
      "of fibers or bundle of fiber transmitting impulses A sensation.",
      "of fibers or bundle of impulses transmitting fiber A sensation.",
      "of fibers or bundle of impulses transmitting A fiber sensation.",
      "of fibers or bundle A impulses transmitting of fiber sensation.",
      "of fibers or A bundle impulses transmitting of fiber sensation."
    ]
  },
  {
    "word": "bucolic",
    "type": "adjective",
    "definitions": [
      "Relating to the pleasant aspects of the countryside and country life",
      "Relating to the pleasant aspects of countryside the and country life",
      "Relating to the pleasant aspects of country the and countryside life",
      "Relating of the pleasant aspects to country the and countryside life",
      "Relating the of pleasant aspects to country the and countryside life",
      "Relating the of pleasant and to country the aspects countryside life",
      "Relating countryside of pleasant and to country the aspects the life"
    ]
  },
  {
    "word": "win",
    "type": "verb",
    "definitions": [
      "To be successful or victorious in a contest or conflict.",
      "To be successful contest victorious in a or or conflict.",
      "To be successful contest victorious a in or or conflict.",
      "victorious be successful contest To a in or or conflict.",
      "victorious be successful contest To or in a or conflict.",
      "victorious be successful contest a or in To or conflict.",
      "victorious be successful To a or in contest or conflict."
    ]
  },
  {
    "word": "lane",
    "type": "noun",
    "definitions": [
      "A narrow road, especially in a rural area location.",
      "A narrow road, especially in area rural a location.",
      "A area road, especially in narrow rural a location.",
      "especially area road, A in narrow rural a location.",
      "especially area road, A narrow in rural a location.",
      "especially area narrow A road, in rural a location.",
      "A area narrow especially road, in rural a location."
    ]
  },
  {
    "word": "lake",
    "type": "noun",
    "definitions": [
      "A large area of water surrounded by land area.",
      "A large water of area surrounded by land area.",
      "by large water of area surrounded A land area.",
      "by large water of area land A surrounded area.",
      "surrounded large water of area land A by area.",
      "large surrounded water of area land A by area.",
      "large water surrounded of area land A by area."
    ]
  },
  {
    "word": "cover",
    "type": "noun",
    "definitions": [
      "A thing that lies on, over, or around something else.",
      "or thing that lies on, over, A around something else.",
      "on, thing that lies or over, A around something else.",
      "something thing that lies or over, A around on, else.",
      "something thing that lies or over, A on, around else.",
      "something thing that lies around over, A on, or else.",
      "something thing that lies around over, on, A or else."
    ]
  },
  {
    "word": "apple",
    "type": "noun",
    "definitions": [
      "A round fruit with firm white flesh and red or green skin.",
      "A round with fruit firm white flesh and red or green skin.",
      "A round with fruit flesh white firm and red or green skin.",
      "A round with fruit flesh white and firm red or green skin.",
      "firm round with fruit flesh white and A red or green skin.",
      "firm round with fruit flesh red and A white or green skin.",
      "firm round with fruit red flesh and A white or green skin."
    ]
  },
  {
    "word": "rope",
    "type": "noun",
    "definitions": [
      "A length of strong cord made by twisting strands together.",
      "A twisting of strong cord made by length strands together.",
      "A twisting strands strong cord made by length of together.",
      "A twisting strands strong by made cord length of together.",
      "A twisting length strong by made cord strands of together.",
      "A twisting length made by strong cord strands of together.",
      "by twisting length made A strong cord strands of together."
    ]
  },
  {
    "word": "bet",
    "type": "verb",
    "definitions": [
      "To risk a sum of money against someone else\u0027s sum.",
      "To against a sum of money risk someone else\u0027s sum.",
      "someone against a sum of money risk To else\u0027s sum.",
      "someone against a sum of money risk else\u0027s To sum.",
      "someone sum a against of money risk else\u0027s To sum.",
      "sum someone a against of money risk else\u0027s To sum.",
      "sum someone against a of money risk else\u0027s To sum."
    ]
  },
  {
    "word": "coil",
    "type": "verb",
    "definitions": [
      "To arrange or wind something long flexible into loops circles.",
      "To arrange or wind into long flexible something loops circles.",
      "To arrange or wind into loops flexible something long circles.",
      "To arrange or wind into flexible loops something long circles.",
      "To wind or arrange into flexible loops something long circles.",
      "into wind or arrange To flexible loops something long circles.",
      "into To or arrange wind flexible loops something long circles."
    ]
  },
  {
    "word": "group",
    "type": "noun",
    "definitions": [
      "A number of people or things located close together.",
      "A located of people or things number close together.",
      "A located of people number things or close together.",
      "A located of close number things or people together.",
      "A of located close number things or people together.",
      "A of located close number people or things together.",
      "A of located close people number or things together."
    ]
  },
  {
    "word": "boy",
    "type": "noun",
    "definitions": [
      "A male child or young man before reaching full adulthood.",
      "A male child before young man or reaching full adulthood.",
      "A man child before young male or reaching full adulthood.",
      "A man child before young male full reaching or adulthood.",
      "A man child or young male full reaching before adulthood.",
      "A man child reaching young male full or before adulthood.",
      "A man before reaching young male full or child adulthood."
    ]
  },
  {
    "word": "card",
    "type": "noun",
    "definitions": [
      "A piece of thick, stiff paper or thin pasteboard.",
      "A piece of stiff thick, paper or thin pasteboard.",
      "piece A of stiff thick, paper or thin pasteboard.",
      "piece A of thin thick, paper or stiff pasteboard.",
      "A piece of thin thick, paper or stiff pasteboard.",
      "A piece or thin thick, paper of stiff pasteboard.",
      "thin piece or A thick, paper of stiff pasteboard."
    ]
  },
  {
    "word": "stagnate",
    "type": "verb",
    "definitions": [
      "(of water or air) cease to flow or move.",
      "(of cease or air) water to flow or move.",
      "water cease or air) (of to flow or move.",
      "water cease or or (of to flow air) move.",
      "or cease or water (of to flow air) move.",
      "or flow or water (of to cease air) move.",
      "or flow or water cease to (of air) move."
    ]
  },
  {
    "word": "jar",
    "type": "noun",
    "definitions": [
      "A wide-mouthed cylindrical container made of glass or pottery.",
      "A of cylindrical container made wide-mouthed glass or pottery.",
      "A of cylindrical container glass wide-mouthed made or pottery.",
      "A of cylindrical container glass wide-mouthed or made pottery.",
      "A of cylindrical container or wide-mouthed glass made pottery.",
      "wide-mouthed of cylindrical container or A glass made pottery.",
      "wide-mouthed of cylindrical container or made glass A pottery."
    ]
  },
  {
    "word": "shape",
    "type": "noun",
    "definitions": [
      "The external form, contours, or outline of someone or something.",
      "outline external form, contours, or The of someone or something.",
      "outline contours, form, external or The of someone or something.",
      "outline of form, external or The contours, someone or something.",
      "outline of form, external or someone contours, The or something.",
      "or of form, external or someone contours, The outline something.",
      "of or form, external or someone contours, The outline something."
    ]
  },
  {
    "word": "itch",
    "type": "verb",
    "definitions": [
      "To experience an uncomfortable sensation on the skin causing desire.",
      "experience To an uncomfortable sensation on the skin causing desire.",
      "experience To an uncomfortable sensation on skin the causing desire.",
      "experience To an causing sensation on skin the uncomfortable desire.",
      "experience To sensation causing an on skin the uncomfortable desire.",
      "experience To sensation causing an skin on the uncomfortable desire.",
      "uncomfortable To sensation causing an skin on the experience desire."
    ]
  },
  {
    "word": "plan",
    "type": "noun",
    "definitions": [
      "A detailed proposal for doing or achieving something specific.",
      "or detailed proposal for doing A achieving something specific.",
      "or detailed proposal doing for A achieving something specific.",
      "or detailed A doing for proposal achieving something specific.",
      "or detailed A doing proposal for achieving something specific.",
      "or detailed A proposal doing for achieving something specific.",
      "or for A proposal doing detailed achieving something specific."
    ]
  },
  {
    "word": "spire",
    "type": "noun",
    "definitions": [
      "A tapering conical or pyramidal structure on the top of a church tower.",
      "tapering A conical or pyramidal structure on the top of a church tower.",
      "tapering A structure or pyramidal conical on the top of a church tower.",
      "on A structure or pyramidal conical tapering the top of a church tower.",
      "on A a or pyramidal conical tapering the top of structure church tower.",
      "on A a or pyramidal conical the tapering top of structure church tower.",
      "or A a on pyramidal conical the tapering top of structure church tower."
    ]
  },
  {
    "word": "mud",
    "type": "noun",
    "definitions": [
      "Soft, sticky matter resulting from mixing earth and water together.",
      "Soft, sticky matter resulting water mixing earth and from together.",
      "water sticky matter resulting Soft, mixing earth and from together.",
      "water sticky Soft, resulting matter mixing earth and from together.",
      "water sticky Soft, and matter mixing earth resulting from together.",
      "water resulting Soft, and matter mixing earth sticky from together.",
      "water resulting Soft, and sticky mixing earth matter from together."
    ]
  },
  {
    "word": "ear",
    "type": "noun",
    "definitions": [
      "The organ of hearing and balance in humans and other vertebrates.",
      "The and of hearing and balance in humans organ other vertebrates.",
      "The and balance hearing and of in humans organ other vertebrates.",
      "The and balance hearing and of in organ humans other vertebrates.",
      "hearing and balance The and of in organ humans other vertebrates.",
      "hearing humans balance The and of in organ and other vertebrates.",
      "hearing humans balance The and of in and organ other vertebrates."
    ]
  },
  {
    "word": "camp",
    "type": "noun",
    "definitions": [
      "A place with temporary shelters such as tents or huts.",
      "A temporary with place shelters such as tents or huts.",
      "A temporary such place shelters with as tents or huts.",
      "such temporary A place shelters with as tents or huts.",
      "such temporary A place shelters with or tents as huts.",
      "as temporary A place shelters with or tents such huts.",
      "as temporary A place shelters with tents or such huts."
    ]
  },
  {
    "word": "inform",
    "type": "verb",
    "definitions": [
      "To tell someone about particular facts or information.",
      "To about someone tell particular facts or information.",
      "To about facts tell particular someone or information.",
      "facts about To tell particular someone or information.",
      "facts about particular tell To someone or information.",
      "To about particular tell facts someone or information.",
      "To tell particular about facts someone or information."
    ]
  },
  {
    "word": "knot",
    "type": "noun",
    "definitions": [
      "A fastening made by looping a piece of string, rope.",
      "string, fastening made by looping a piece of A rope.",
      "string, fastening made by looping a of piece A rope.",
      "string, fastening made by looping of a piece A rope.",
      "by fastening made string, looping of a piece A rope.",
      "by fastening piece string, looping of a made A rope.",
      "by fastening piece of looping string, a made A rope."
    ]
  },
  {
    "word": "crowd",
    "type": "noun",
    "definitions": [
      "A large number of people gathered together in one place.",
      "one large number of people gathered together in A place.",
      "one large number of people gathered in together A place.",
      "one large number together people gathered in of A place.",
      "one of number together people gathered in large A place.",
      "one of number together people gathered large in A place.",
      "one of number together people large gathered in A place."
    ]
  },
  {
    "word": "glass",
    "type": "noun",
    "definitions": [
      "A hard, brittle substance, typically transparent, made from sand.",
      "A hard, brittle typically substance, transparent, made from sand.",
      "typically hard, brittle A substance, transparent, made from sand.",
      "substance, hard, brittle A typically transparent, made from sand.",
      "hard, substance, brittle A typically transparent, made from sand.",
      "A substance, brittle hard, typically transparent, made from sand.",
      "A substance, brittle hard, typically made transparent, from sand."
    ]
  },
  {
    "word": "dense",
    "type": "adjective",
    "definitions": [
      "Closely compacted in substance; thick or crowded together tightly packed.",
      "or compacted in substance; thick Closely crowded together tightly packed.",
      "substance; compacted in or thick Closely crowded together tightly packed.",
      "substance; compacted in or together Closely crowded thick tightly packed.",
      "substance; tightly in or together Closely crowded thick compacted packed.",
      "substance; thick in or together Closely crowded tightly compacted packed.",
      "substance; compacted in or together Closely crowded tightly thick packed."
    ]
  },
  {
    "word": "beep",
    "type": "noun",
    "definitions": [
      "A short high-pitched sound emitted by electronic equipment.",
      "high-pitched short A sound emitted by electronic equipment.",
      "high-pitched short A sound electronic by emitted equipment.",
      "high-pitched electronic A sound short by emitted equipment.",
      "A electronic high-pitched sound short by emitted equipment.",
      "A emitted high-pitched sound short by electronic equipment.",
      "A high-pitched emitted sound short by electronic equipment."
    ]
  },
  {
    "word": "box",
    "type": "noun",
    "definitions": [
      "A container with a flat base, sides, and often a lid.",
      "A base, with a flat container sides, and often a lid.",
      "A base, with often flat container sides, and a a lid.",
      "a base, with often flat container sides, and a A lid.",
      "a base, container often flat with sides, and a A lid.",
      "a container base, often flat with sides, and a A lid.",
      "base, container a often flat with sides, and a A lid."
    ]
  },
  {
    "word": "girl",
    "type": "noun",
    "definitions": [
      "A female child or young woman before reaching full adulthood.",
      "A female child or woman young before reaching full adulthood.",
      "A woman child or female young before reaching full adulthood.",
      "or woman child A female young before reaching full adulthood.",
      "or woman child full female young before reaching A adulthood.",
      "or woman child full female reaching before young A adulthood.",
      "A woman child full female reaching before young or adulthood."
    ]
  },
  {
    "word": "worm",
    "type": "noun",
    "definitions": [
      "A long, soft-bodied invertebrate animal living in soil or water.",
      "A long, soft-bodied invertebrate animal or in soil living water.",
      "A long, soft-bodied in animal or invertebrate soil living water.",
      "soil long, soft-bodied in animal or invertebrate A living water.",
      "soil long, animal in soft-bodied or invertebrate A living water.",
      "soil long, animal soft-bodied in or invertebrate A living water.",
      "soil long, animal soft-bodied in or living A invertebrate water."
    ]
  },
  {
    "word": "sugar",
    "type": "noun",
    "definitions": [
      "A sweet crystalline substance obtained from various plants, especially cane.",
      "A sweet crystalline substance from obtained various plants, especially cane.",
      "A sweet substance crystalline from obtained various plants, especially cane.",
      "A sweet substance especially from obtained various plants, crystalline cane.",
      "substance sweet A especially from obtained various plants, crystalline cane.",
      "substance sweet A especially from obtained crystalline plants, various cane.",
      "substance sweet plants, especially from obtained crystalline A various cane."
    ]
  },
  {
    "word": "whip",
    "type": "verb",
    "definitions": [
      "To beat cream, eggs, or other food into frothy mass.",
      "To beat cream, food or other eggs, into frothy mass.",
      "food beat cream, To or other eggs, into frothy mass.",
      "food beat cream, To other or eggs, into frothy mass.",
      "food beat cream, To other into eggs, or frothy mass.",
      "food cream, beat To other into eggs, or frothy mass.",
      "food cream, other To beat into eggs, or frothy mass."
    ]
  },
  {
    "word": "grab",
    "type": "verb",
    "definitions": [
      "To grasp or seize something suddenly and roughly using hands.",
      "To grasp or seize something using and roughly suddenly hands.",
      "To using or seize something grasp and roughly suddenly hands.",
      "To suddenly or seize something grasp and roughly using hands.",
      "To suddenly or seize using grasp and roughly something hands.",
      "To suddenly or seize grasp using and roughly something hands.",
      "To suddenly grasp seize or using and roughly something hands."
    ]
  },
  {
    "word": "sand",
    "type": "noun",
    "definitions": [
      "A loose granular substance resulting from erosion of siliceous rocks.",
      "A loose granular resulting substance from erosion of siliceous rocks.",
      "A from granular resulting substance loose erosion of siliceous rocks.",
      "substance from granular resulting A loose erosion of siliceous rocks.",
      "substance granular from resulting A loose erosion of siliceous rocks.",
      "substance granular loose resulting A from erosion of siliceous rocks.",
      "substance granular loose resulting A from of erosion siliceous rocks."
    ]
  },
  {
    "word": "wipe",
    "type": "verb",
    "definitions": [
      "To clean or dry something by rubbing it with cloth.",
      "To clean with dry something by rubbing it or cloth.",
      "To clean with by something dry rubbing it or cloth.",
      "To clean with or something dry rubbing it by cloth.",
      "To clean by or something dry rubbing it with cloth.",
      "To or by clean something dry rubbing it with cloth.",
      "To or by clean dry something rubbing it with cloth."
    ]
  },
  {
    "word": "thank",
    "type": "verb",
    "definitions": [
      "To express gratitude to someone, especially by saying polite words.",
      "to express gratitude To someone, especially by saying polite words.",
      "to express gratitude especially someone, To by saying polite words.",
      "to someone, gratitude especially express To by saying polite words.",
      "by someone, gratitude especially express To to saying polite words.",
      "by someone, gratitude especially express polite to saying To words.",
      "to someone, gratitude especially express polite by saying To words."
    ]
  },
  {
    "word": "crew",
    "type": "noun",
    "definitions": [
      "A group of people who work on and operate a ship.",
      "A group people of who work on and operate a ship.",
      "A group people who of work on and operate a ship.",
      "A group people who of and on work operate a ship.",
      "A group people who of and on work a operate ship.",
      "A group people on of and who work a operate ship.",
      "A group people operate of and who work a on ship."
    ]
  },
  {
    "word": "guest",
    "type": "noun",
    "definitions": [
      "A person who is invited to visit someone\u0027s home.",
      "A person someone\u0027s is invited to visit who home.",
      "A visit someone\u0027s is invited to person who home.",
      "A to someone\u0027s is invited visit person who home.",
      "A to visit is invited someone\u0027s person who home.",
      "A to visit is invited someone\u0027s who person home.",
      "A is visit to invited someone\u0027s who person home."
    ]
  },
  {
    "word": "horn",
    "type": "noun",
    "definitions": [
      "A hard pointed projection on the head of some animals.",
      "projection hard pointed A on the head of some animals.",
      "on hard pointed A projection the head of some animals.",
      "some hard pointed A projection the head of on animals.",
      "some pointed hard A projection the head of on animals.",
      "some pointed hard A of the head projection on animals.",
      "some hard pointed A of the head projection on animals."
    ]
  },
  {
    "word": "dog",
    "type": "noun",
    "definitions": [
      "A domestic mammal with four legs, related to the wolf.",
      "A domestic related with four legs, mammal to the wolf.",
      "A domestic related with four legs, to mammal the wolf.",
      "with domestic related A four legs, to mammal the wolf.",
      "with domestic related A legs, four to mammal the wolf.",
      "with legs, related A domestic four to mammal the wolf.",
      "with legs, A related domestic four to mammal the wolf."
    ]
  },
  {
    "word": "root",
    "type": "noun",
    "definitions": [
      "The part of a plant which attaches it to ground.",
      "The part of a attaches which plant it to ground.",
      "to part of a attaches which plant it The ground.",
      "to a of part attaches which plant it The ground.",
      "to a of part attaches The plant it which ground.",
      "to a of part attaches The plant which it ground.",
      "to a of which attaches The plant part it ground."
    ]
  },
  {
    "word": "spill",
    "type": "verb",
    "definitions": [
      "To cause or allow liquid to flow over the edge.",
      "To cause or liquid allow to flow over the edge.",
      "To liquid or cause allow to flow over the edge.",
      "To liquid or cause allow to flow the over edge.",
      "To liquid or to allow cause flow the over edge.",
      "To liquid to or allow cause flow the over edge.",
      "flow liquid to or allow cause To the over edge."
    ]
  },
  {
    "word": "glove",
    "type": "noun",
    "definitions": [
      "A covering for the hand with separate parts for each finger.",
      "A covering for each hand with separate parts for the finger.",
      "A for covering each hand with separate parts for the finger.",
      "A for covering each hand the separate parts for with finger.",
      "the for covering each hand A separate parts for with finger.",
      "with for covering each hand A separate parts for the finger.",
      "with for covering each hand A separate for parts the finger."
    ]
  },
  {
    "word": "floor",
    "type": "noun",
    "definitions": [
      "The lower surface of a room, on which one may walk.",
      "on lower surface of a room, The which one may walk.",
      "on lower which of a room, The surface one may walk.",
      "on one which of a room, The surface lower may walk.",
      "on one which room, a of The surface lower may walk.",
      "on one which The a of room, surface lower may walk.",
      "may one which The a of room, surface lower on walk."
    ]
  },
  {
    "word": "fog",
    "type": "noun",
    "definitions": [
      "A thick cloud of tiny water droplets suspended near earth\u0027s surface.",
      "A thick cloud of tiny water droplets suspended earth\u0027s near surface.",
      "A thick cloud of earth\u0027s water droplets suspended tiny near surface.",
      "near thick cloud of earth\u0027s water droplets suspended tiny A surface.",
      "near thick earth\u0027s of cloud water droplets suspended tiny A surface.",
      "tiny thick earth\u0027s of cloud water droplets suspended near A surface.",
      "tiny thick earth\u0027s of cloud near droplets suspended water A surface."
    ]
  },
  {
    "word": "frame",
    "type": "noun",
    "definitions": [
      "A rigid structure surrounding something such as a picture or door.",
      "A rigid structure picture something such as a surrounding or door.",
      "or rigid structure picture something such as a surrounding A door.",
      "or rigid such picture something structure as a surrounding A door.",
      "or rigid surrounding picture something structure as a such A door.",
      "or rigid surrounding picture as structure something a such A door.",
      "or rigid surrounding picture as a something structure such A door."
    ]
  },
  {
    "word": "affable",
    "type": "adjective",
    "definitions": [
      "Friendly, good-natured, or easy to talk to.",
      "Friendly, good-natured, easy or to talk to.",
      "good-natured, Friendly, easy or to talk to.",
      "talk Friendly, easy or to good-natured, to.",
      "talk Friendly, to or easy good-natured, to.",
      "talk good-natured, to or easy Friendly, to.",
      "Friendly, good-natured, to or easy talk to."
    ]
  },
  {
    "word": "pause",
    "type": "noun",
    "definitions": [
      "A temporary stop in action or speech before resuming activity.",
      "A in stop temporary action or speech before resuming activity.",
      "A in stop speech action or temporary before resuming activity.",
      "A resuming stop speech action or temporary before in activity.",
      "A resuming speech stop action or temporary before in activity.",
      "A resuming speech stop before or temporary action in activity.",
      "A temporary speech stop before or resuming action in activity."
    ]
  },
  {
    "word": "corn",
    "type": "noun",
    "definitions": [
      "A tall plant yielding large grains, or kernels, set in rows.",
      "A tall plant kernels, large grains, or yielding set in rows.",
      "A tall plant kernels, large set or yielding grains, in rows.",
      "A tall plant set large kernels, or yielding grains, in rows.",
      "A tall plant set large kernels, or yielding in grains, rows.",
      "A grains, plant set large kernels, or yielding in tall rows.",
      "A grains, plant in large kernels, or yielding set tall rows."
    ]
  },
  {
    "word": "saw",
    "type": "verb",
    "definitions": [
      "To cut wood or other hard material using hand tool.",
      "To cut wood or material hard other using hand tool.",
      "To cut wood or hand hard other using material tool.",
      "To cut wood or other hard hand using material tool.",
      "To cut using or other hard hand wood material tool.",
      "hard cut using or other To hand wood material tool.",
      "hard cut using or other To material wood hand tool."
    ]
  },
  {
    "word": "slide",
    "type": "verb",
    "definitions": [
      "To move along a smooth surface while maintaining continuous contact.",
      "To move smooth a along surface while maintaining continuous contact.",
      "a move smooth To along surface while maintaining continuous contact.",
      "a move smooth To maintaining surface while along continuous contact.",
      "a maintaining smooth To move surface while along continuous contact.",
      "a maintaining smooth continuous move surface while along To contact.",
      "a maintaining To continuous move surface while along smooth contact."
    ]
  },
  {
    "word": "fruit",
    "type": "noun",
    "definitions": [
      "The sweet and fleshy product of a tree or other plant.",
      "The sweet and fleshy product of a or tree other plant.",
      "The sweet and fleshy product of tree or a other plant.",
      "The sweet and fleshy other of tree or a product plant.",
      "The sweet and or other of tree fleshy a product plant.",
      "The and sweet or other of tree fleshy a product plant.",
      "The and sweet or other of tree product a fleshy plant."
    ]
  },
  {
    "word": "jail",
    "type": "noun",
    "definitions": [
      "A place for the confinement of people accused or convicted.",
      "A place for or confinement of people accused the convicted.",
      "A place for or confinement of the accused people convicted.",
      "A place for or confinement the of accused people convicted.",
      "or place for A confinement the of accused people convicted.",
      "or of for A confinement the place accused people convicted.",
      "or of accused A confinement the place for people convicted."
    ]
  },
  {
    "word": "smell",
    "type": "verb",
    "definitions": [
      "To perceive or detect the odor or scent of something.",
      "To or or detect the odor perceive scent of something.",
      "To or scent detect the odor perceive or of something.",
      "To or scent detect perceive odor the or of something.",
      "To or the detect perceive odor scent or of something.",
      "To or the detect perceive odor or scent of something.",
      "To of the detect perceive odor or scent or something."
    ]
  },
  {
    "word": "trip",
    "type": "noun",
    "definitions": [
      "A journey or excursion, especially one undertaken for pleasure.",
      "A journey one excursion, especially or undertaken for pleasure.",
      "A journey one excursion, for or undertaken especially pleasure.",
      "A journey one excursion, for or especially undertaken pleasure.",
      "A for one excursion, journey or especially undertaken pleasure.",
      "A one for excursion, journey or especially undertaken pleasure.",
      "A one for undertaken journey or especially excursion, pleasure."
    ]
  },
  {
    "word": "net",
    "type": "noun",
    "definitions": [
      "An open-meshed material made of twine, cord, or wire.",
      "An of material made open-meshed twine, cord, or wire.",
      "An of material open-meshed made twine, cord, or wire.",
      "An of cord, open-meshed made twine, material or wire.",
      "An material cord, open-meshed made twine, of or wire.",
      "An material twine, open-meshed made cord, of or wire.",
      "An material or open-meshed made cord, of twine, wire."
    ]
  },
  {
    "word": "heart",
    "type": "noun",
    "definitions": [
      "A hollow muscular organ that pumps blood through the body.",
      "A hollow muscular organ that pumps through blood the body.",
      "A hollow the organ that pumps through blood muscular body.",
      "A hollow the organ through pumps that blood muscular body.",
      "A the hollow organ through pumps that blood muscular body.",
      "A that hollow organ through pumps the blood muscular body.",
      "A organ hollow that through pumps the blood muscular body."
    ]
  },
  {
    "word": "blind",
    "type": "adjective",
    "definitions": [
      "Unable to see because of injury, disease, or congenital condition.",
      "Unable of see because to injury, disease, or congenital condition.",
      "Unable of see because congenital injury, disease, or to condition.",
      "Unable of see because congenital disease, injury, or to condition.",
      "Unable of see to congenital disease, injury, or because condition.",
      "Unable see of to congenital disease, injury, or because condition.",
      "Unable congenital of to see disease, injury, or because condition."
    ]
  },
  {
    "word": "shock",
    "type": "noun",
    "definitions": [
      "A sudden upsetting or surprising event or experience causing distress.",
      "A or upsetting sudden surprising event or experience causing distress.",
      "A or upsetting causing surprising event or experience sudden distress.",
      "surprising or upsetting causing A event or experience sudden distress.",
      "surprising or upsetting causing A sudden or experience event distress.",
      "surprising or event causing A sudden or experience upsetting distress.",
      "surprising or event causing A upsetting or experience sudden distress."
    ]
  },
  {
    "word": "evil",
    "type": "adjective",
    "definitions": [
      "Profoundly immoral and wicked; embodying harmful or malevolent force.",
      "Profoundly immoral embodying wicked; and harmful or malevolent force.",
      "Profoundly immoral wicked; embodying and harmful or malevolent force.",
      "harmful immoral wicked; embodying and Profoundly or malevolent force.",
      "harmful immoral wicked; embodying malevolent Profoundly or and force.",
      "or immoral wicked; embodying malevolent Profoundly harmful and force.",
      "wicked; immoral or embodying malevolent Profoundly harmful and force."
    ]
  },
  {
    "word": "malevolent",
    "type": "adjective",
    "definitions": [
      "Having or showing a wish to do evil to others.",
      "Having or showing a evil to do wish to others.",
      "wish or showing a evil to do Having to others.",
      "wish or showing a evil to to Having do others.",
      "do or showing a evil to to Having wish others.",
      "to or showing a evil do to Having wish others.",
      "to or showing a evil to do Having wish others."
    ]
  },
  {
    "word": "sense",
    "type": "noun",
    "definitions": [
      "A faculty by which the body perceives an external stimulus.",
      "A faculty by which the body an perceives external stimulus.",
      "A faculty by which body the an perceives external stimulus.",
      "A faculty by body which the an perceives external stimulus.",
      "A faculty by body external the an perceives which stimulus.",
      "A body by faculty external the an perceives which stimulus.",
      "A body by faculty external the perceives an which stimulus."
    ]
  },
  {
    "word": "bid",
    "type": "verb",
    "definitions": [
      "To offer a certain price for something, especially at auction.",
      "To a offer certain price for something, especially at auction.",
      "To a offer price certain for something, especially at auction.",
      "To a offer price certain especially something, for at auction.",
      "To at offer price certain especially something, for a auction.",
      "To at offer price certain especially a for something, auction.",
      "To at offer certain price especially a for something, auction."
    ]
  },
  {
    "word": "brave",
    "type": "adjective",
    "definitions": [
      "Ready to face and endure danger or pain; showing courage.",
      "Ready to face and endure or danger pain; showing courage.",
      "Ready to danger and endure or face pain; showing courage.",
      "Ready to danger and or endure face pain; showing courage.",
      "to Ready danger and or endure face pain; showing courage.",
      "to Ready danger or and endure face pain; showing courage.",
      "to danger Ready or and endure face pain; showing courage."
    ]
  },
  {
    "word": "key",
    "type": "noun",
    "definitions": [
      "A small piece of shaped metal for operating a lock.",
      "A small piece metal shaped of for operating a lock.",
      "A small piece metal shaped of a operating for lock.",
      "A small piece metal shaped of a for operating lock.",
      "A small piece for shaped of a metal operating lock.",
      "A small piece a shaped of for metal operating lock.",
      "A small of a shaped piece for metal operating lock."
    ]
  },
  {
    "word": "eat",
    "type": "verb",
    "definitions": [
      "To put food into the mouth and chew swallow it.",
      "food put To into the mouth and chew swallow it.",
      "food put To into the mouth and swallow chew it.",
      "food put To into mouth the and swallow chew it.",
      "food put To into swallow the and mouth chew it.",
      "food To put into swallow the and mouth chew it.",
      "food To put into the swallow and mouth chew it."
    ]
  },
  {
    "word": "track",
    "type": "noun",
    "definitions": [
      "A rough path or road, typically one beaten by use.",
      "A rough path road, or typically one beaten by use.",
      "A rough path one or typically road, beaten by use.",
      "A rough path or one typically road, beaten by use.",
      "A rough or path one typically road, beaten by use.",
      "A rough or path one road, typically beaten by use.",
      "A rough or path one by typically beaten road, use."
    ]
  },
  {
    "word": "dim",
    "type": "adjective",
    "definitions": [
      "Not shining brightly or clearly; emitting or having faint light.",
      "Not emitting brightly or clearly; shining or having faint light.",
      "Not emitting brightly clearly; or shining or having faint light.",
      "Not emitting brightly shining or clearly; or having faint light.",
      "Not emitting brightly shining or clearly; faint having or light.",
      "Not emitting brightly shining or clearly; faint or having light.",
      "or emitting brightly shining or clearly; faint Not having light."
    ]
  },
  {
    "word": "lamb",
    "type": "noun",
    "definitions": [
      "A young sheep used as food, known for tenderness.",
      "A known sheep used as food, young for tenderness.",
      "A known food, used as sheep young for tenderness.",
      "sheep known food, used as A young for tenderness.",
      "sheep known food, as used A young for tenderness.",
      "sheep used food, as known A young for tenderness.",
      "food, used sheep as known A young for tenderness."
    ]
  },
  {
    "word": "news",
    "type": "noun",
    "definitions": [
      "Newly received or noteworthy information about recent or important events.",
      "Newly received or recent information about noteworthy or important events.",
      "Newly received or recent information about noteworthy important or events.",
      "Newly received or recent or about noteworthy important information events.",
      "Newly received noteworthy recent or about or important information events.",
      "Newly received noteworthy important or about or recent information events.",
      "Newly received noteworthy important or recent or about information events."
    ]
  },
  {
    "word": "earn",
    "type": "verb",
    "definitions": [
      "To obtain money in return for labor or services rendered.",
      "in obtain money To return for labor or services rendered.",
      "in obtain for To return money labor or services rendered.",
      "in obtain or To return money labor for services rendered.",
      "labor obtain or To return money in for services rendered.",
      "labor or obtain To return money in for services rendered.",
      "labor To obtain or return money in for services rendered."
    ]
  },
  {
    "word": "bean",
    "type": "noun",
    "definitions": [
      "An edible seed, typically kidney-shaped, growing in long pods.",
      "long edible seed, typically kidney-shaped, growing in An pods.",
      "long edible seed, typically kidney-shaped, in growing An pods.",
      "long kidney-shaped, seed, typically edible in growing An pods.",
      "long kidney-shaped, edible typically seed, in growing An pods.",
      "long An edible typically seed, in growing kidney-shaped, pods.",
      "long An edible kidney-shaped, seed, in growing typically pods."
    ]
  },
  {
    "word": "edge",
    "type": "noun",
    "definitions": [
      "The outside limit of an object, area, or surface boundary.",
      "The outside an of limit object, area, or surface boundary.",
      "The outside or of limit object, area, an surface boundary.",
      "The outside or of limit an area, object, surface boundary.",
      "The outside or limit of an area, object, surface boundary.",
      "The outside or limit area, an of object, surface boundary.",
      "The outside or limit an area, of object, surface boundary."
    ]
  },
  {
    "word": "nest",
    "type": "noun",
    "definitions": [
      "A structure built by birds or animals as shelter.",
      "A structure built birds by or animals as shelter.",
      "A structure or birds by built animals as shelter.",
      "as structure or birds by built animals A shelter.",
      "as structure or birds A built animals by shelter.",
      "as structure birds or A built animals by shelter.",
      "A structure birds or as built animals by shelter."
    ]
  },
  {
    "word": "fail",
    "type": "verb",
    "definitions": [
      "To be unsuccessful in achieving one\u0027s goal or desired outcome.",
      "To be unsuccessful achieving in one\u0027s goal or desired outcome.",
      "To one\u0027s unsuccessful achieving in be goal or desired outcome.",
      "To goal unsuccessful achieving in be one\u0027s or desired outcome.",
      "To goal unsuccessful achieving in desired one\u0027s or be outcome.",
      "To goal achieving unsuccessful in desired one\u0027s or be outcome.",
      "one\u0027s goal achieving unsuccessful in desired To or be outcome."
    ]
  },
  {
    "word": "city",
    "type": "noun",
    "definitions": [
      "A large town with buildings, streets, and many inhabitants.",
      "A large town and buildings, streets, with many inhabitants.",
      "A large many and buildings, streets, with town inhabitants.",
      "A large many and buildings, streets, town with inhabitants.",
      "A large many and buildings, town streets, with inhabitants.",
      "A large with and buildings, town streets, many inhabitants.",
      "many large with and buildings, town streets, A inhabitants."
    ]
  },
  {
    "word": "incriminate",
    "type": "verb",
    "definitions": [
      "Make someone appear guilty of a crime or wrongdoing.",
      "appear someone Make guilty of a crime or wrongdoing.",
      "appear someone or guilty of a crime Make wrongdoing.",
      "appear someone or guilty of a Make crime wrongdoing.",
      "appear someone a guilty of or Make crime wrongdoing.",
      "appear someone a guilty of or crime Make wrongdoing.",
      "appear someone a guilty of Make crime or wrongdoing."
    ]
  },
  {
    "word": "hurt",
    "type": "verb",
    "definitions": [
      "To cause pain or injury to oneself or another person.",
      "To cause or pain injury to oneself or another person.",
      "To cause or injury pain to oneself or another person.",
      "To cause or or pain to oneself injury another person.",
      "To cause another or pain to oneself injury or person.",
      "To cause another or to pain oneself injury or person.",
      "To oneself another or to pain cause injury or person."
    ]
  },
  {
    "word": "coach",
    "type": "verb",
    "definitions": [
      "To train or instruct a team or player for sport.",
      "instruct train or To a team or player for sport.",
      "instruct for or To a team or player train sport.",
      "instruct a or To for team or player train sport.",
      "instruct a or player for team or To train sport.",
      "instruct train or player for team or To a sport.",
      "train instruct or player for team or To a sport."
    ]
  },
  {
    "word": "bed",
    "type": "noun",
    "definitions": [
      "A piece of furniture used for sleeping or resting upon.",
      "piece A of furniture used for sleeping or resting upon.",
      "piece A of furniture for used sleeping or resting upon.",
      "piece A of used for furniture sleeping or resting upon.",
      "piece A of used or furniture sleeping for resting upon.",
      "piece A of furniture or used sleeping for resting upon.",
      "piece A of or furniture used sleeping for resting upon."
    ]
  },
  {
    "word": "drum",
    "type": "noun",
    "definitions": [
      "A percussion instrument sounded by being struck with sticks or hands.",
      "sticks percussion instrument sounded by being struck with A or hands.",
      "sticks percussion A sounded by being struck with instrument or hands.",
      "A percussion sticks sounded by being struck with instrument or hands.",
      "A sticks percussion sounded by being struck with instrument or hands.",
      "A or percussion sounded by being struck with instrument sticks hands.",
      "struck or percussion sounded by being A with instrument sticks hands."
    ]
  },
  {
    "word": "book",
    "type": "noun",
    "definitions": [
      "A written work consisting of pages glued or sewn together.",
      "A written work consisting of or glued pages sewn together.",
      "A glued work consisting of or written pages sewn together.",
      "A glued work consisting of pages written or sewn together.",
      "A glued work consisting of pages or written sewn together.",
      "A glued work consisting or pages of written sewn together.",
      "work glued A consisting or pages of written sewn together."
    ]
  },
  {
    "word": "grape",
    "type": "noun",
    "definitions": [
      "A berry, typically green, purple, or black, growing in clusters.",
      "A berry, green, typically purple, or black, growing in clusters.",
      "A berry, green, purple, typically or black, growing in clusters.",
      "A purple, green, berry, typically or black, growing in clusters.",
      "A purple, green, berry, typically black, or growing in clusters.",
      "A purple, black, berry, typically green, or growing in clusters.",
      "A purple, berry, black, typically green, or growing in clusters."
    ]
  },
  {
    "word": "doyen",
    "type": "noun",
    "definitions": [
      "The most respected or prominent person in a particular field.",
      "in most respected or prominent person The a particular field.",
      "a most respected or prominent person The in particular field.",
      "most a respected or prominent person The in particular field.",
      "most a respected prominent or person The in particular field.",
      "particular a respected prominent or person The in most field.",
      "particular a respected prominent or in The person most field."
    ]
  },
  {
    "word": "label",
    "type": "noun",
    "definitions": [
      "A small piece of paper, fabric attached to object giving information.",
      "A small piece of to fabric attached paper, object giving information.",
      "A small piece of giving fabric attached paper, object to information.",
      "A paper, piece of giving fabric attached small object to information.",
      "A paper, piece fabric giving of attached small object to information.",
      "to paper, piece fabric giving of attached small object A information.",
      "fabric paper, piece to giving of attached small object A information."
    ]
  },
  {
    "word": "field",
    "type": "noun",
    "definitions": [
      "An area of open land, especially one planted with crops.",
      "An area of open one especially land, planted with crops.",
      "An one of open area especially land, planted with crops.",
      "An one of open especially area land, planted with crops.",
      "An of one open especially area land, planted with crops.",
      "of An one open especially area land, planted with crops.",
      "of An one land, especially area open planted with crops."
    ]
  },
  {
    "word": "embezzle",
    "type": "verb",
    "definitions": [
      "Steal or misappropriate money belonging to the organization for which one works.",
      "Steal or misappropriate money belonging to the which for organization one works.",
      "Steal or one money belonging to the which for organization misappropriate works.",
      "Steal or one money belonging which the to for organization misappropriate works.",
      "Steal or one belonging money which the to for organization misappropriate works.",
      "Steal one or belonging money which the to for organization misappropriate works.",
      "which one or belonging money Steal the to for organization misappropriate works."
    ]
  },
  {
    "word": "alter",
    "type": "verb",
    "definitions": [
      "To change or cause to change in character or composition.",
      "To change or cause to or in character change composition.",
      "To change or cause to character in or change composition.",
      "To change or cause to character or in change composition.",
      "To change to cause or character or in change composition.",
      "change To to cause or character or in change composition.",
      "change To to cause character or or in change composition."
    ]
  },
  {
    "word": "tax",
    "type": "noun",
    "definitions": [
      "A compulsory contribution to state revenue, levied by government.",
      "A compulsory contribution state to revenue, levied by government.",
      "A compulsory contribution levied to revenue, state by government.",
      "compulsory A contribution levied to revenue, state by government.",
      "compulsory A contribution to levied revenue, state by government.",
      "compulsory A contribution to state revenue, levied by government.",
      "compulsory contribution A to state revenue, levied by government."
    ]
  },
  {
    "word": "cheek",
    "type": "noun",
    "definitions": [
      "Either side of the face below the eye and above jaw.",
      "Either side of the the below face eye and above jaw.",
      "Either the of the side below face eye and above jaw.",
      "below the of the side Either face eye and above jaw.",
      "below face of the side Either the eye and above jaw.",
      "below face of the side eye the Either and above jaw.",
      "the face of below side eye the Either and above jaw."
    ]
  },
  {
    "word": "wish",
    "type": "noun",
    "definitions": [
      "A desire or hope for something to happen in future.",
      "A desire or hope for to something happen in future.",
      "A for or hope desire to something happen in future.",
      "to for or hope desire A something happen in future.",
      "hope for or to desire A something happen in future.",
      "hope for or something desire A to happen in future.",
      "hope for or happen desire A to something in future."
    ]
  },
  {
    "word": "spade",
    "type": "noun",
    "definitions": [
      "A tool with a sharp-edged, metal blade and a long handle, used for digging.",
      "A tool with a blade metal sharp-edged, and a long handle, used for digging.",
      "used tool with a blade metal sharp-edged, and a long handle, A for digging.",
      "used tool metal a blade with sharp-edged, and a long handle, A for digging.",
      "used tool metal a blade with sharp-edged, and handle, long a A for digging.",
      "handle, tool metal a blade with sharp-edged, and used long a A for digging.",
      "handle, tool metal a and with sharp-edged, blade used long a A for digging."
    ]
  },
  {
    "word": "bent",
    "type": "adjective",
    "definitions": [
      "Sharply curved or having an angle; not straight or level.",
      "Sharply curved straight having an angle; not or or level.",
      "Sharply curved straight having an or not or angle; level.",
      "Sharply curved straight or an or not having angle; level.",
      "Sharply curved having or an or not straight angle; level.",
      "Sharply curved or having an or not straight angle; level.",
      "an curved or having Sharply or not straight angle; level."
    ]
  },
  {
    "word": "moon",
    "type": "noun",
    "definitions": [
      "The natural satellite of the earth, visible mainly at night.",
      "The natural at of the earth, visible mainly satellite night.",
      "The the at of natural earth, visible mainly satellite night.",
      "mainly the at of natural earth, visible The satellite night.",
      "visible the at of natural earth, mainly The satellite night.",
      "visible the at of natural satellite mainly The earth, night.",
      "visible natural at of the satellite mainly The earth, night."
    ]
  },
  {
    "word": "lie",
    "type": "noun",
    "definitions": [
      "An intentionally false statement made by a person or group.",
      "An intentionally false statement or by a person made group.",
      "intentionally An false statement or by a person made group.",
      "intentionally An false statement or by person a made group.",
      "intentionally An by statement or false person a made group.",
      "intentionally An by statement false or person a made group.",
      "intentionally An by a false or person statement made group."
    ]
  },
  {
    "word": "revolve",
    "type": "verb",
    "definitions": [
      "Move in a circle on a central axis.",
      "a in a circle on Move central axis.",
      "a Move a circle on in central axis.",
      "a Move a circle central in on axis.",
      "in Move a circle central a on axis.",
      "Move in a circle central a on axis.",
      "Move a a circle central in on axis."
    ]
  },
  {
    "word": "watch",
    "type": "noun",
    "definitions": [
      "A small timepiece worn typically on a strap on wrist.",
      "small A timepiece worn typically on a strap on wrist.",
      "small A a worn typically on timepiece strap on wrist.",
      "small A a worn strap on timepiece typically on wrist.",
      "small A a worn strap on timepiece on typically wrist.",
      "strap A a worn small on timepiece on typically wrist.",
      "strap A timepiece worn small on a on typically wrist."
    ]
  },
  {
    "word": "catalyst",
    "type": "noun",
    "definitions": [
      "A person or thing that precipitates an event.",
      "A precipitates or thing that person an event.",
      "A precipitates or person that thing an event.",
      "A person or precipitates that thing an event.",
      "A that or precipitates person thing an event.",
      "A that thing precipitates person or an event.",
      "A that thing precipitates or person an event."
    ]
  },
  {
    "word": "ride",
    "type": "noun",
    "definitions": [
      "A journey made on horseback, bicycle, motorcycle, or in vehicle.",
      "A journey motorcycle, on horseback, bicycle, made or in vehicle.",
      "A journey motorcycle, on bicycle, horseback, made or in vehicle.",
      "A horseback, motorcycle, on bicycle, journey made or in vehicle.",
      "A motorcycle, horseback, on bicycle, journey made or in vehicle.",
      "A motorcycle, horseback, on in journey made or bicycle, vehicle.",
      "A motorcycle, horseback, on made journey in or bicycle, vehicle."
    ]
  },
  {
    "word": "exam",
    "type": "noun",
    "definitions": [
      "A formal test of a person\u0027s knowledge or proficiency.",
      "a formal test of A person\u0027s knowledge or proficiency.",
      "a formal test of A person\u0027s or knowledge proficiency.",
      "a test formal of A person\u0027s or knowledge proficiency.",
      "a test formal person\u0027s A of or knowledge proficiency.",
      "knowledge test formal person\u0027s A of or a proficiency.",
      "knowledge a formal person\u0027s A of or test proficiency."
    ]
  },
  {
    "word": "slump",
    "type": "verb",
    "definitions": [
      "Sit, lean, or fall heavily and limply.",
      "Sit, or lean, fall heavily and limply.",
      "Sit, fall lean, or heavily and limply.",
      "fall Sit, lean, or heavily and limply.",
      "fall or lean, Sit, heavily and limply.",
      "fall or lean, and heavily Sit, limply.",
      "fall or Sit, and heavily lean, limply."
    ]
  },
  {
    "word": "crush",
    "type": "verb",
    "definitions": [
      "To deform, pulverize, or force inwards by compressing object hard.",
      "inwards deform, pulverize, or force To by compressing object hard.",
      "inwards deform, pulverize, or force To by object compressing hard.",
      "deform, inwards pulverize, or force To by object compressing hard.",
      "deform, inwards pulverize, or To force by object compressing hard.",
      "or inwards pulverize, deform, To force by object compressing hard.",
      "or inwards object deform, To force by pulverize, compressing hard."
    ]
  },
  {
    "word": "scrub",
    "type": "verb",
    "definitions": [
      "To rub hard so as to clean, typically with brush.",
      "to rub hard so as To clean, typically with brush.",
      "to clean, hard so as To rub typically with brush.",
      "hard clean, to so as To rub typically with brush.",
      "hard clean, to as so To rub typically with brush.",
      "hard with to as so To rub typically clean, brush.",
      "hard with so as to To rub typically clean, brush."
    ]
  },
  {
    "word": "club",
    "type": "noun",
    "definitions": [
      "An association dedicated to a particular interest or activity group.",
      "An association interest to a particular dedicated or activity group.",
      "association An interest to a particular dedicated or activity group.",
      "association An interest to or particular dedicated a activity group.",
      "activity An interest to or particular dedicated a association group.",
      "activity dedicated interest to or particular An a association group.",
      "activity a interest to or particular An dedicated association group."
    ]
  },
  {
    "word": "plot",
    "type": "noun",
    "definitions": [
      "The main events of a play, novel, film, or work.",
      "The novel, events of a play, main film, or work.",
      "The novel, of events a play, main film, or work.",
      "The novel, main events a play, of film, or work.",
      "The a main events novel, play, of film, or work.",
      "The a main events film, play, of novel, or work.",
      "main a The events film, play, of novel, or work."
    ]
  },
  {
    "word": "loan",
    "type": "noun",
    "definitions": [
      "A thing that is borrowed, especially a sum of money.",
      "A thing that is especially borrowed, a sum of money.",
      "A thing that of especially borrowed, a sum is money.",
      "A is that of especially borrowed, a sum thing money.",
      "A is that of especially borrowed, sum a thing money.",
      "A is that of borrowed, especially sum a thing money.",
      "A is sum of borrowed, especially that a thing money."
    ]
  },
  {
    "word": "need",
    "type": "verb",
    "definitions": [
      "To require something because it is essential or very important.",
      "essential require something because it is To or very important.",
      "essential require something because or is To it very important.",
      "essential require To because or is something it very important.",
      "essential because To require or is something it very important.",
      "essential or To require because is something it very important.",
      "it or To require because is something essential very important."
    ]
  },
  {
    "word": "rice",
    "type": "noun",
    "definitions": [
      "A swamp grass cultivated in warm climates, major food crop.",
      "A swamp cultivated grass in warm climates, major food crop.",
      "A food cultivated grass in warm climates, major swamp crop.",
      "A climates, cultivated grass in warm food major swamp crop.",
      "A climates, cultivated warm in grass food major swamp crop.",
      "cultivated climates, A warm in grass food major swamp crop.",
      "cultivated warm A climates, in grass food major swamp crop."
    ]
  },
  {
    "word": "dream",
    "type": "noun",
    "definitions": [
      "A series of thoughts, images, and sensations occurring during sleep.",
      "A series sensations thoughts, images, and of occurring during sleep.",
      "A series sensations occurring images, and of thoughts, during sleep.",
      "A series and occurring images, sensations of thoughts, during sleep.",
      "of series and occurring images, sensations A thoughts, during sleep.",
      "of series and occurring images, during A thoughts, sensations sleep.",
      "of series and occurring images, during sensations thoughts, A sleep."
    ]
  },
  {
    "word": "wool",
    "type": "noun",
    "definitions": [
      "The dense, soft, often curly hair forming the coat of sheep.",
      "The dense, soft, forming curly hair often the coat of sheep.",
      "dense, The soft, forming curly hair often the coat of sheep.",
      "often The soft, forming curly hair dense, the coat of sheep.",
      "often The soft, forming curly of dense, the coat hair sheep.",
      "often The soft, forming curly coat dense, the of hair sheep.",
      "often The dense, forming curly coat soft, the of hair sheep."
    ]
  },
  {
    "word": "love",
    "type": "verb",
    "definitions": [
      "To feel deep affection or great liking for another person.",
      "another feel deep affection or great liking for To person.",
      "another feel deep affection or To liking for great person.",
      "another feel affection deep or To liking for great person.",
      "another feel affection deep for To liking or great person.",
      "another for affection deep feel To liking or great person.",
      "another for affection deep or To liking feel great person."
    ]
  },
  {
    "word": "route",
    "type": "noun",
    "definitions": [
      "A way or course taken in getting from starting point.",
      "A in or course taken way getting from starting point.",
      "course in or A taken way getting from starting point.",
      "course in or A taken getting way from starting point.",
      "course or in A taken getting way from starting point.",
      "starting or in A taken getting way from course point.",
      "taken or in A starting getting way from course point."
    ]
  },
  {
    "word": "drug",
    "type": "noun",
    "definitions": [
      "A medicine or other substance which has a physiological effect.",
      "A medicine or other which substance has a physiological effect.",
      "A physiological or other which substance has a medicine effect.",
      "A physiological or medicine which substance has a other effect.",
      "A physiological or medicine substance which has a other effect.",
      "which physiological or medicine substance A has a other effect.",
      "physiological which or medicine substance A has a other effect."
    ]
  },
  {
    "word": "kit",
    "type": "noun",
    "definitions": [
      "A set of articles or equipment needed for specific purpose.",
      "A set of articles or for needed equipment specific purpose.",
      "specific set of articles or for needed equipment A purpose.",
      "articles set of specific or for needed equipment A purpose.",
      "articles set of specific or for equipment needed A purpose.",
      "articles set of specific for or equipment needed A purpose.",
      "set articles of specific for or equipment needed A purpose."
    ]
  },
  {
    "word": "accommodate",
    "type": "verb",
    "definitions": [
      "To fit in with the wishes or needs of.",
      "in fit To with the wishes or needs of.",
      "in fit To with or wishes the needs of.",
      "in To fit with or wishes the needs of.",
      "wishes To fit with or in the needs of.",
      "To wishes fit with or in the needs of.",
      "To wishes fit with in or the needs of."
    ]
  },
  {
    "word": "fan",
    "type": "noun",
    "definitions": [
      "An apparatus with rotating blades that creates a current of air.",
      "An that with rotating blades apparatus creates a current of air.",
      "An that with rotating blades apparatus creates of current a air.",
      "An that with rotating of apparatus creates blades current a air.",
      "An current with rotating of apparatus creates blades that a air.",
      "An rotating with current of apparatus creates blades that a air.",
      "An rotating with current of apparatus creates that blades a air."
    ]
  },
  {
    "word": "wave",
    "type": "noun",
    "definitions": [
      "A long body of water curling into an arched form.",
      "A long body of curling water into an arched form.",
      "A water body of curling long into an arched form.",
      "A water curling of body long into an arched form.",
      "A water curling of body long arched an into form.",
      "A water curling into body long arched an of form.",
      "A water curling into body arched long an of form."
    ]
  },
  {
    "word": "cloud",
    "type": "noun",
    "definitions": [
      "A visible mass of water droplets suspended in the atmosphere.",
      "A visible mass of water in suspended droplets the atmosphere.",
      "A visible mass of in water suspended droplets the atmosphere.",
      "A visible mass of suspended water in droplets the atmosphere.",
      "A visible in of suspended water mass droplets the atmosphere.",
      "A visible in of droplets water mass suspended the atmosphere.",
      "A visible in of droplets mass water suspended the atmosphere."
    ]
  },
  {
    "word": "glue",
    "type": "noun",
    "definitions": [
      "An adhesive substance used for sticking objects or materials together.",
      "An adhesive substance used for sticking or objects materials together.",
      "An adhesive sticking used for substance or objects materials together.",
      "An adhesive sticking used for substance or materials objects together.",
      "An adhesive sticking used substance for or materials objects together.",
      "An adhesive sticking used substance for objects materials or together.",
      "An adhesive sticking used substance or objects materials for together."
    ]
  },
  {
    "word": "clock",
    "type": "noun",
    "definitions": [
      "An instrument that measures and indicates time using hands or a display.",
      "indicates instrument that measures and An time using hands or a display.",
      "indicates instrument that An and measures time using hands or a display.",
      "and instrument that An indicates measures time using hands or a display.",
      "and instrument that An indicates measures using time hands or a display.",
      "and instrument that An indicates using measures time hands or a display.",
      "and instrument that An indicates using measures time or hands a display."
    ]
  },
  {
    "word": "prize",
    "type": "noun",
    "definitions": [
      "A thing given as a reward to the winner competition.",
      "A reward given as a thing to the winner competition.",
      "A reward given as a thing to winner the competition.",
      "A reward given as a to thing winner the competition.",
      "as reward given A a to thing winner the competition.",
      "as reward given A a thing to winner the competition.",
      "as reward a A given thing to winner the competition."
    ]
  },
  {
    "word": "report",
    "type": "verb",
    "definitions": [
      "To give a spoken or written account of something observed.",
      "To give a or spoken written account of something observed.",
      "spoken give a or To written account of something observed.",
      "spoken give or a To written account of something observed.",
      "spoken give something a To written account of or observed.",
      "spoken give something a written To account of or observed.",
      "spoken give To a written something account of or observed."
    ]
  },
  {
    "word": "cat",
    "type": "noun",
    "definitions": [
      "A small domestic carnivorous mammal with soft fur, short snout.",
      "small A domestic carnivorous mammal with soft fur, short snout.",
      "small A domestic short mammal with soft fur, carnivorous snout.",
      "small A domestic short soft with mammal fur, carnivorous snout.",
      "carnivorous A domestic short soft with mammal fur, small snout.",
      "carnivorous A short domestic soft with mammal fur, small snout.",
      "carnivorous A short domestic with soft mammal fur, small snout."
    ]
  },
  {
    "word": "waste",
    "type": "noun",
    "definitions": [
      "Material that is not wanted; the unusable remains or residue.",
      "Material that unusable not wanted; the is remains or residue.",
      "Material is unusable not wanted; the that remains or residue.",
      "Material is unusable not wanted; remains that the or residue.",
      "Material is unusable remains wanted; not that the or residue.",
      "Material wanted; unusable remains is not that the or residue.",
      "Material the unusable remains is not that wanted; or residue."
    ]
  }
]